//
//  Localizable.strings
//
//  Copyright 2009-2011 Adobe Systems, Inc. All rights reserved.


// APPLICATION
"GetSupport" = "Get support";
"GetLabsUninstaller" = "Get Uninstaller";


// DISPATCHER
"ReinstallButtonDescription" = "Install the latest version";
"UninstallButtonDescription" = "Remove the current installation";

"ReinstallButtonTitle" = "GET LATEST";
"UninstallButtonTitle" = "UNINSTALL";


// INSTALL CHECK
"CannotInstallFlashPlayer" = "Adobe® Flash® Player cannot be installed.\n";
"NewerFlashPlayerAlreadyInstalled" = "A newer version of the software is already installed on this system.";
"InstalledVersionTitle" = "Installed version:";
"ThisVersionTitle" = "This version:";
"SystemDoesNotMeetMinimumRequirements" = "This system does not meet the minimum requirements for installation. Mac OS X %@ or higher is required.";
"NeedToUninstallFirst" = "You must run the Flash Player uninstaller before installing this version of Flash Player. Please visit the Adobe Labs web page to download the uninstaller.";

// WELCOME
"LicenseAgreementLink" = "Read the license here.";
"ReadAndAgreeToTermsOfUse" = "I have read and agree to the terms of the Flash Player License Agreement.";


// CLOSE FP CLIENTS
"CloseFPClientsDescription1" = "Close the following application(s) to continue:";
"CloseFPClientsDescription2" = "You may close them manually or by clicking below.";

"ForceCloseAllButtonTitle" = "Force Close All";

"CloseAppsDialogTitle" = "Close additional applications";
"CloseAppsDialogMessage" = "There are still some applications that must be closed.\n\nClick OK for an updated list.";

"OKButtonTitle" = "OK";
"CloseButtonTitle" = "Close";


// INSTALL
"FPInstallerWindowTitle" = "Adobe Flash Player %@ Installer";

"EnableInstallMessage" = "To enable the install, click the checkbox above to accept the license agreement.";

"InstallingMessage" = "Installing…";
"InstallPercentage" = "%d%%";
"FinalizingInstallationMessage" = "Finalizing installation…";

"InstallButtonTitle" = "INSTALL";
"RetryButtonTitle" = "RETRY";
"QuitButtonTitle" = "QUIT";
"DoneButtonTitle" = "DONE";
"DownloadButtonTitle" = "DOWNLOAD";

// +--> Success
"InstallSucceededTitle" = "Installation of Flash Player %@ is complete";
"RestartBrowserMessage" = "Please restart your browser";

// +--> Failure
"InstallFailedTitle" = "Installation failed";
"InstallFailedDescription" = "This installation failed.";
"ErrorLogTitle" = "Error Log:";


// UPDATE OPTIONS
"UpdateOptionsTitle" = "Update Flash Player Preferences";
"UpdateOptionsSubheader" = "Security updates and enhancements can be downloaded and installed automatically.";
"UpdateMethodSelectionTitle" = "Choose your update method:";
"UpdateOption_InstallAutomatically" = "Allow Adobe to install updates (recommended)";
"UpdateOption_NotifyUser" = "Notify me to install updates";
"UpdateOption_DoNotCheckForUpdates" = "Never check for updates (not recommended)";
"UpdateOptionsLearnMore" = "Learn More";
"UpdateOptionsLearnMoreURL" = "http://www.adobe.com/go/learnmore_fp_updates";


// UNINSTALL
"FPUninstallerWindowTitle" = "Adobe Flash Player Uninstaller";
"UninstallDescriptionText" = "This program will remove Adobe® Flash® Player from your computer.";
"UninstallDescriptionText_PlusTentacleRemover" = "This program will remove Adobe® Flash® Player and all related cache files and settings from your computer.";

"UninstallingMessage" = "Uninstalling…";
"UninstallCompletedTitle" = "Completed";

// +--> Success
"UninstallSucceededText" = "Adobe® Flash® Player was removed from your system.";


// AUTOUPDATE
// Checking for updates
"CheckInternetConnection" = "Could not load update information. Check your Internet connection and try again.";
"CheckingForUpdatesText" = "Getting update information…";

// No update available
"FlashPlayerIsUpToDate" = "Adobe® Flash® Player is up to date on your system.";

// Update available
"AutoUpdateXmlLocale" = "en";
"FPAutoUpdateWindowTitle" = "Update Adobe Flash Player";
"UpdateAvailableText" = "An update to Adobe® Flash® Player is available.";
"InstallThisUpdateQuestion" = "Install this update?";
"ChangeSettingsText" = "You can change your update settings in the Local Settings Manager.";
"LaunchLSMLink" = "Launch Local Settings Manager";

"RemindMeLaterButtonTitle" = "REMIND ME LATER";


// Download Progress Panel
"CancelButtonTitle" = "CANCEL";
"DownloadSucceededTitle" = "Download succeeded";
"DownloadFailedTitle" = "Download failed";
"DownloadPercentage" = "%d%%";
"DownloadFailedDescription" = "An error has occurred while downloading the installer. Make sure you are connected to the Internet and try again.";
"DownloadingMessage" = "Downloading…";
"VerifyingDownloadMessage" = "Verifying Download…";
"UnpackingDownloadMessage" = "Unpacking Download…";
"LaunchingInstallerMessage" = "Launching Installer…";

// Redirect URL
"PDCRedirectU​RL" = "https://get3.adobe.com/flashplayer/update/osx";
"PPAPIPDCRedirectU​RL" = "https://get3.adobe.com/flashplayer/update/ppapiosx";

// Analytics Options
"AnalyticsTitle" = "Usage Data";
"AnalyticsCheckboxLabel" = "Send Anonymous Usage Data";
"AnalyticsCheckboxDescription" = "Help us improve Adobe Flash Player by sending anonymous usage data. You can change this selection at any time.";
"AnalyticsLearnMore" = "Learn More";
"AnalyticsLearnMoreURL" = "http://www.adobe.com/go/fp_learn_more_usage_data";
